"""
Напишите программу, которая выводит слова введённой строки (части, разделённые символами пустого пространства)
в столбик. Нужно обойтись только методами split и join у строк, в программе должен быть всего один вызов print.
"""
print("\n".join(input().split()))
