"""
Напишите программу, которая распечатает все натуральные числа от 1 до 17 включительно.
Каждое число следует выводить на отдельной строке.
"""
count = 1
while count <= 17:
    print(count)
    count += 1
