"""
Напишите программу, которая распечатает все натуральные числа от 25 до 14 включительно.
Каждое число следует выводить на отдельной строке.
"""
num = 25
while num >= 14:
    print(num)
    num -= 1
