"""
Напишите программу, которая напечатает строку, состоящую из 777 букв
"""
print("W" * 777)
