"""
Напишите программу, которая выводит «» (без внешних кавычек).
"""
print('Лев Николаевич Толстой написал "Война и мир"')
