"""
Напишите программу, которая сначала считывает две фразы по очереди, а потом воспроизводит их в той же
    последовательности, каждую на отдельной строчке.
"""
for _ in range(2):
    print(input())
