"""
Напишите программу, которая сначала считывает три фразы по очереди,
а потом воспроизводит их в обратной последовательности, каждую на отдельной строчке.
"""
x1 = input()
x2 = input()
x3 = input()
print(x3, x2, x1, sep="\n")
