"""
Напишите программу, которая запрашивает имя пользователя и его год рождения.
    Программа должна вывести на экран сообщение
    "<Имя пользователя>, вам исполнится 77 лет в <год>"
"""
print(f"{input()}, вам исполнится 77 лет в {int(input()) + 77}")
