"""
Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.
"""
this_is_all = 2000
that_s_not_all = 999
while this_is_all != that_s_not_all:
    that_s_not_all += 1
    print(that_s_not_all)
