"""
Я думаю каждый знаком с квадратом - идеально симметричная и ровная фигура. Давайте напишем программу,
    которая вычисляет площадь квадрата по введенной длине.

    Формула вычисления площади квадрата следующая:

    S=a2

Входные данные

    На вход программе поступает вещественное число a

Выходные данные

    Программа выводит площадь квадрата
"""
print(float(input()) ** 2)
