"""
Напишите программу, которая принимает на вход два целых числа в отдельных строках и выводит на экран их сумму.
"""
print(int(input()) + int(input()))
