"""
Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками),
заданного двумя значениями x1 и x2 (вещественные числа).
"""
print(abs(float(input()) - float(input())))
