"""
Дано целое положительное трехзначное число, ваша задача найти сумму разрядов этого числа
"""
print(sum(int(x) for x in input()))
