"""
Дано целое число n. Выведите следующее за ним четное число.

Задачу необходимо решить целочисленными операциями без использования условных операторов и\или циклов.
"""
print((int(input()) // 2 + 1) * 2)
